anLTT/STM32-Github/Plant_Incubator/Sensor/SCD40/STD/SCD30(1)/SCD30/Hardware/MPU6050.c
#include "stm32f10x.h"                  // Device header
#include "MyI2C.h"
#include "MPU6050_REG.h"
#define MPU6050_ADDRESS       0xD0

void MPU6050_WriteReg(uint8_t RegAddress, uint8_t Data)     //指定地址写寄存器
{
	MyI2C_Start();										    //开始通信
	MyI2C_SendByte(MPU6050_ADDRESS);					    //读取设备
	MyI2C_ReceiveAck();									    //接收应答位
	MyI2C_SendByte(RegAddress);							    //读取设备中的寄存器（准备写）
	MyI2C_ReceiveAck();										//接收应答位
	MyI2C_SendByte(Data);									//向寄存器中写入数据
	MyI2C_ReceiveAck();										//接收应答位
	MyI2C_Stop();  											//停止通信
}

uint8_t MPU6050_ReadReg(uint8_t RegAddress)    //指定地址读寄存器
{
	uint8_t Data;
	
	MyI2C_Start();											//开始通信
	MyI2C_SendByte(MPU6050_ADDRESS);						//读取设备
	MyI2C_ReceiveAck();										//接收应答位
	MyI2C_SendByte(RegAddress);								//读取设备中的寄存器
	MyI2C_ReceiveAck();										//接收应答位
	
	MyI2C_Start();											//开始通信
	MyI2C_SendByte(MPU6050_ADDRESS | 0x01);					//读取设备中的寄存器（准备读）
	MyI2C_ReceiveAck();										//接收应答位
	Data = MyI2C_ReceiveByte();								//读取数据
	MyI2C_SendAck(1);										//发送非应答位（告诉从机不准备继续读取）
	MyI2C_Stop();  											//停止通信
	
	return Data;
}

void MPU6050_Init(void)
{
	MyI2C_Init();
	MPU6050_WriteReg(MPU6050_PWR_MGMT_1,0x01);				//接触睡眠 陀螺仪时钟
	MPU6050_WriteReg(MPU6050_PWR_MGMT_2,0x00);      		//6轴不待机
	MPU6050_WriteReg(MPU6050_SMPLRT_DIV,0x09);		
	MPU6050_WriteReg(MPU6050_CONFIG,0x06);	
	MPU6050_WriteReg(MPU6050_GYRO_CONFIG,0x18);
	MPU6050_WriteReg(MPU6050_ACCEL_CONFIG,0x18);	
}

uint8_t MPU6050_GetID(void)
{
	return MPU6050_ReadReg(MPU6050_WHO_AM_I);				//读取设备ID
}

void MPU6050_GetData(int16_t *AccX, int16_t *AccY, int16_t *AccZ,
	int16_t *GyroX, int16_t *GyroY, int16_t *GyroZ)
{
	uint16_t DataH, DataL;
	
	DataH = MPU6050_ReadReg(MPU6050_ACCEL_XOUT_H);
	DataL = MPU6050_ReadReg(MPU6050_ACCEL_XOUT_L);
	*AccX = (DataH <<8 | DataL);
	
	DataH = MPU6050_ReadReg(MPU6050_ACCEL_YOUT_H);
	DataL = MPU6050_ReadReg(MPU6050_ACCEL_YOUT_L);
	*AccY = (DataH <<8 | DataL);
	
	DataH = MPU6050_ReadReg(MPU6050_ACCEL_ZOUT_H);
	DataL = MPU6050_ReadReg(MPU6050_ACCEL_ZOUT_L);
	*AccZ = (DataH <<8 | DataL);
	
	DataH = MPU6050_ReadReg(MPU6050_GYRO_XOUT_H);
	DataL = MPU6050_ReadReg(MPU6050_GYRO_XOUT_L);
	*GyroX = (DataH <<8 | DataL);
	
	DataH = MPU6050_ReadReg(MPU6050_GYRO_YOUT_H);
	DataL = MPU6050_ReadReg(MPU6050_GYRO_YOUT_L);
	*GyroY = (DataH <<8 | DataL);
	
	DataH = MPU6050_ReadReg(MPU6050_GYRO_ZOUT_H);
	DataL = MPU6050_ReadReg(MPU6050_GYRO_ZOUT_L);
	*GyroZ = (DataH <<8 | DataL);
}
